tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "rafaelgarrido/caveats"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Asynchronous DNS library
brew "c-ares"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Open-source formatting library for C++
brew "fmt"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Asynchronous event library
brew "libevent"
# NaCl networking and cryptography library
brew "libsodium"
# Compression/decompression library aiming for high speed
brew "snappy"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Framework for layout and rendering of i18n text
brew "pango"
# H.265/HEVC encoder
brew "x265"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU grep, egrep and fgrep
brew "grep"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Open h.265 video codec implementation
brew "libde265"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# LLVM's OpenMP runtime library
brew "libomp"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Macro processing language
brew "m4"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line launcher for macOS, in the spirit of `open`
brew "launch"
# Library to render SVG files using Cairo
brew "librsvg"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Mac App Store command-line interface
brew "mas"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Text-based UI library
brew "ncurses"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Open source suite of directory software
brew "openldap"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Perl compatible regular expressions library
brew "pcre"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Perform tasks asynchronously without external tools
brew "zsh-async"
# Zsh prompt for Astronauts
brew "spaceship"
# Manipulate and query tags on macOS files
brew "tag"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Lightweight BitTorrent client
brew "transmission-cli", restart_service: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Build, bundle & ship your Rust WASM application to the web
brew "trunk"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Meta-level vim package manager
brew "volt"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Formulae Caveats Shortcut for Homebrew Package Manager
brew "rafaelgarrido/caveats/brew-caveats"
# Application uninstaller
cask "appcleaner"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Open links in any browser
cask "choosy"
# Two-panel file manager
cask "commander-one"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
# PDF reader
cask "foxitreader"
# Tool to measure the computer system's performance
cask "geekbench"
# Cross-platform AI benchmark to evaluate AI workload performance
cask "geekbench-ml"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Windows manager and desktop organiser
cask "hazeover"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Helps you learn to play your instrument
cask "melodics"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# OpenJDK distribution from Microsoft
cask "microsoft-openjdk"
# OpenJDK distribution from Microsoft
cask "microsoft-openjdk@11"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to move and zoom windows—on one display
cask "moom"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Digital audio production application
cask "reaper"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Salesforce CLI tools
cask "sf"
# Team communication and collaboration software
cask "slack"
# Desktop client for Salesforce.com platform
cask "soqlxplorer"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Quicklook extension for source files
cask "syntax-highlight"
# Unpacks archive files
cask "the-unarchiver"
# Automatic time and productivity tracking app
cask "timing"
# Keyboard configurator
cask "via"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Controller", id: 1198176727
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Mapper", id: 1589391989
mas "Noir", id: 1592917505
mas "Paste", id: 967805235
mas "Photomator", id: 1444636541
mas "Signal Shifter", id: 6446061552
mas "Spaced", id: 1666327168
mas "Spotica Menu", id: 570549457
mas "StopTheMadness Pro", id: 6471380298
mas "Tonebridge Guitar Effects", id: 1263858588
mas "Typist", id: 415166115
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
